src/cf/src/Catalogs/ТелеграмБоты/ТелеграмБоты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТелеграмБоты</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ТелеграмСтатусыИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>Жетон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогСохраненияФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияОбновлений</name>
    <type>
      <types>EnumRef.ТелеграмСпособыПолученияОбновлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВебхукАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВебхукКлюч</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСамозаверенныйСертификат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PEMИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PEM</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченныйДоступ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправкиСообщенийЗадач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Enums/ТелеграмСтатусыИспользования/ТелеграмСтатусыИспользования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТелеграмСтатусыИспользования</name>
  <enumValues>
    <name>Используется</name>
  </enumValues>
  <enumValues>
    <name>Выключен</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ТелеграмСпособыПолученияОбновлений/ТелеграмСпособыПолученияОбновлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТелеграмСпособыПолученияОбновлений</name>
  <enumValues>
    <name>ПериодическийЗапрос</name>
  </enumValues>
  <enumValues>
    <name>Вебхуки</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/ТелеграмБоты/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолучениеОбновленийПриИзменении(Элемент)
	
	ПодключитьОтключитьОбработчикОжидания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	ПодключитьОтключитьОбработчикОжидания();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПанельПолученияОбновлений(Команда)
	
	Элементы.ФормаПанельПолученияОбновлений.Пометка = НЕ Элементы.ФормаПанельПолученияОбновлений.Пометка;
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаПанельПолученияОбновлений.Видимость = Элементы.ФормаПанельПолученияОбновлений.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОтключитьОбработчикОжидания()
	
	Если ПолучениеОбновлений = Истина Тогда
		Если Периодичность > 0 Тогда
			ПодключитьОбработчикОжидания("ПолучениеОбновлений", Периодичность, Ложь);
		Иначе
			ПолучениеОбновлений = Ложь;
			ОтключитьОбработчикОжидания("ПолучениеОбновлений");
			ПоказатьПредупреждение(, "Не задана периодичность получения обновлений");
		КонецЕсли;
	Иначе
		ОтключитьОбработчикОжидания("ПолучениеОбновлений");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеОбновлений()
	
	ПолучениеОбновленийСервер();
	ПоследнееПолучение = ОбщегоНазначенияКлиент.ДатаСеанса();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучениеОбновленийСервер()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТелеграмБоты.Ссылка
	|ИЗ
	|	Справочник.ТелеграмБоты КАК ТелеграмБоты
	|ГДЕ
	|	ТелеграмБоты.Статус = ЗНАЧЕНИЕ(Перечисление.ТелеграмСтатусыИспользования.Используется)
	|	И ТелеграмБоты.СпособПолученияОбновлений = ЗНАЧЕНИЕ(Перечисление.ТелеграмСпособыПолученияОбновлений.ПериодическийЗапрос)";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не найден ни один бот со статусом Используется и со способом получения обновлений Периодический запрос.'"));
		Возврат;
	Иначе
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТелеграмСервер.ПолучитьОбновленияБота(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
